<?php

/*
15. Написать калькулятор. Переменная $a = изменяемое число. Переменная $b = изменяемое число. 
Переменная $operator = ‘+’ или ‘-’ или ‘/’ или ‘*’ или '%' (остаток от деления). 
На экран выводить результат в зависимости от значений этих переменных. 
Не забудьте про деление на 0, если надо - выдавать ошибку что на 0 делить нельзя. 
*/
$a = 10;
$b = 2;
$operator = '%';

if($b==0){
	echo "На 0 делить нельзя ;)";
}else{
		switch($operator){
		case '+':
			$res = $a + $b;
			break;
		case '-':
			$res = $a - $b;
			break;
		case '/':
			$res = $a / $b;
			break;
		case '*':
			$res = $a * $b;
			break;
		case '%':
			$res = $a % $b;
			break;
	}
	echo $res;	
}



